[          
	{         
		"title": "Vertigo",               
		"release_year": 1958,
		"storyline": "Hitchcock's romantic story of obsession, manipulation and fear. A detective is forced to retire after his fear of heights causes the death of a fellow officer and the girl he was hired to follow. He sees a double of the girl, causing him to transform her image onto the dead girl's body. This leads into a cycle of madness and lies.",
		"poster_image_url":"https://upload.wikimedia.org/wikipedia/commons/7/75/Vertigomovie_restoration.jpg", 
		"trailer_youtube_url":"https://www.youtube.com/watch?v=Z5jvQwwHQNY",
		"star_rating": 8.4  
	},
    {         
    	"title": "Terminator",          
    	"release_year": 1991,
		"storyline": "In this sequel set eleven years after The Terminator, young John Connor (Edward Furlong), the key to civilization's victory over a future robot uprising, is the target of the shape-shifting T-1000 (Robert Patrick), a Terminator sent from the future to kill him. Another Terminator, the revamped T-800 (Arnold Schwarzenegger), has been sent back to protect the boy. As John and his mother (Linda Hamilton) go on the run with the T-800, the boy forms an unexpected bond with the robot.",
		"poster_image_url":"https://upload.wikimedia.org/wikipedia/en/8/85/Terminator2poster.jpg", 
		"trailer_youtube_url":"https://www.youtube.com/watch?v=lwSysg9o7wE",   
		"star_rating": 8.5  
	},
    {         
    	"title": "As Good As It Gets",          
    	"release_year": 1997,
    	"storyline": "Melvin Udall (Jack Nicholson) is an obsessive-compulsive writer of romantic fiction who's rude to everyone he meets, including his gay neighbor Simon (Greg Kinnear), but when he has to look after Simon's dog, he begins to soften and, if still not completely over his problems, finds he can conduct a relationship with the only waitress (Helen Hunt) at the local diner who'll serve him.",
		"poster_image_url":"http://www.gstatic.com/tv/thumb/dvdboxart/20351/p20351_d_v8_aa.jpg", 
		"trailer_youtube_url":"https://www.youtube.com/watch?v=rrRl2QQKkI8",
		"star_rating": 7.7    
	},
    {         
    	"title": "Pretty Woman",          
    	"release_year": 1990,
    	"storyline": "In this modern update on Cinderella, a prostitute and a wealthy businessman fall hard for one another, forming an unlikely pair. While on a business trip in L.A., Edward (Richard Gere), who makes a living buying and breaking up companies, picks up a hooker, Vivian (Julia Roberts), on a lark. After Edward hires Vivian to stay with him for the weekend, the two get closer, only to discover there are significant hurdles to overcome as they try to bridge the gap between their very different worlds.",         
		"poster_image_url":"https://upload.wikimedia.org/wikipedia/en/b/b6/Pretty_woman_movie.jpg",
		"trailer_youtube_url": "https://www.youtube.com/watch?v=Wzii8IuL8lk",
		"star_rating": 6.9     
	},

    {         
    	"title": "Lost in Translation",          
    	"release_year": 2003,
    	"storyline": "A lonely, aging movie star named Bob Harris (Bill Murray) and a conflicted newlywed, Charlotte (Scarlett Johansson), meet in Tokyo. Bob is there to film a Japanese whiskey commercial; Charlotte is accompanying her celebrity-photographer husband. Strangers in a foreign land, the two find escape, distraction and understanding amidst the bright Tokyo lights after a chance meeting in the quiet lull of the hotel bar. They form a bond that is as unlikely as it is heartfelt and meaningful.",         
		"poster_image_url":"http://www.gstatic.com/tv/thumb/movieposters/32966/p32966_p_v8_ag.jpg",
		"trailer_youtube_url": "https://www.youtube.com/watch?v=sU0oZsqeG_s",
		"star_rating": 7.8    
	},

    {         
    	"title": "Ex Machina",          
    	"release_year": 2015,
		"storyline": "Caleb Smith (Domhnall Gleeson) a programmer at a huge Internet company, wins a contest that enables him to spend a week at the private estate of Nathan Bateman (Oscar Isaac), his firm's brilliant CEO. When he arrives, Caleb learns that he has been chosen to be the human component in a Turing test to determine the capabilities and consciousness of Ava (Alicia Vikander), a beautiful robot. However, it soon becomes evident that Ava is far more self- aware and deceptive than either man imagined.", 
		"poster_image_url":"http://www.scifi-movies.com/images/contenu/data/0004530 /affiche-ex-machina-2015-5.jpg",
		"trailer_youtube_url": "https://www.youtube.com/watch?v=XYGzRB4Pnq8",
		"star_rating": 7.7    
	} 
]
